----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [64, 128, 128]           9,408
       BatchNorm2d-2         [64, 128, 128]             128
              ReLU-3         [64, 128, 128]               0
         MaxPool2d-4           [64, 64, 64]               0
            Conv2d-5           [64, 64, 64]          36,864
       BatchNorm2d-6           [64, 64, 64]             128
              ReLU-7           [64, 64, 64]               0
            Conv2d-8           [64, 64, 64]          36,864
       BatchNorm2d-9           [64, 64, 64]             128
             ReLU-10           [64, 64, 64]               0
       BasicBlock-11           [64, 64, 64]               0
           Conv2d-12           [64, 64, 64]          36,864
      BatchNorm2d-13           [64, 64, 64]             128
             ReLU-14           [64, 64, 64]               0
           Conv2d-15           [64, 64, 64]          36,864
      BatchNorm2d-16           [64, 64, 64]             128
             ReLU-17           [64, 64, 64]               0
       BasicBlock-18           [64, 64, 64]               0
           Conv2d-19          [128, 32, 32]          73,728
      BatchNorm2d-20          [128, 32, 32]             256
             ReLU-21          [128, 32, 32]               0
           Conv2d-22          [128, 32, 32]         147,456
      BatchNorm2d-23          [128, 32, 32]             256
           Conv2d-24          [128, 32, 32]           8,192
      BatchNorm2d-25          [128, 32, 32]             256
             ReLU-26          [128, 32, 32]               0
       BasicBlock-27          [128, 32, 32]               0
           Conv2d-28          [128, 32, 32]         147,456
      BatchNorm2d-29          [128, 32, 32]             256
             ReLU-30          [128, 32, 32]               0
           Conv2d-31          [128, 32, 32]         147,456
      BatchNorm2d-32          [128, 32, 32]             256
             ReLU-33          [128, 32, 32]               0
       BasicBlock-34          [128, 32, 32]               0
           Conv2d-35          [256, 16, 16]         294,912
      BatchNorm2d-36          [256, 16, 16]             512
             ReLU-37          [256, 16, 16]               0
           Conv2d-38          [256, 16, 16]         589,824
      BatchNorm2d-39          [256, 16, 16]             512
           Conv2d-40          [256, 16, 16]          32,768
      BatchNorm2d-41          [256, 16, 16]             512
             ReLU-42          [256, 16, 16]               0
       BasicBlock-43          [256, 16, 16]               0
           Conv2d-44          [256, 16, 16]         589,824
      BatchNorm2d-45          [256, 16, 16]             512
             ReLU-46          [256, 16, 16]               0
           Conv2d-47          [256, 16, 16]         589,824
      BatchNorm2d-48          [256, 16, 16]             512
             ReLU-49          [256, 16, 16]               0
       BasicBlock-50          [256, 16, 16]               0
           Conv2d-51            [512, 8, 8]       1,179,648
      BatchNorm2d-52            [512, 8, 8]           1,024
             ReLU-53            [512, 8, 8]               0
           Conv2d-54            [512, 8, 8]       2,359,296
      BatchNorm2d-55            [512, 8, 8]           1,024
           Conv2d-56            [512, 8, 8]         131,072
      BatchNorm2d-57            [512, 8, 8]           1,024
             ReLU-58            [512, 8, 8]               0
       BasicBlock-59            [512, 8, 8]               0
           Conv2d-60            [512, 8, 8]       2,359,296
      BatchNorm2d-61            [512, 8, 8]           1,024
             ReLU-62            [512, 8, 8]               0
           Conv2d-63            [512, 8, 8]       2,359,296
      BatchNorm2d-64            [512, 8, 8]           1,024
             ReLU-65            [512, 8, 8]               0
       BasicBlock-66            [512, 8, 8]               0
           Linear-67                  [256]         131,328
           Linear-68                  [128]          32,896
           Linear-69                   [64]           8,256
           Linear-70                   [32]           2,080
           Linear-71                   [16]             528
           Linear-72                    [8]             136
           Linear-73                    [4]              36
           Linear-74                    [2]              10
================================================================
Total params: 11,351,782
Trainable params: 11,351,782
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.75
Forward/backward pass size (MB): 82.00
Params size (MB): 43.30
Estimated Total Size (MB): 126.06
----------------------------------------------------------------
11864782
